package com.company;

public class Data {
    public static String[] Cities =
            {
                    "Москва",
                    "Санкт-Петербург",
                    "Кастрома",
                    "Ростов-На-Дону",
                    "Тула"
            };

    public static String[] jobs =
            {
                    "Разработчик сайта          ",
                    "Работник серверной         ",
                    "Информационная безопасность",
                    "Менеджер                   ",
                    "Менеджер по маркетингу     ",
                    "Охранник                   ",
                    "Секретарь                  ",
                    "Креативный директор        ",
                    "Уборщик                    ",
                    "Дизайнер                   "
            };
    public static String[] tasksForServer =
            {
                    "Настроить коммутатор для отдела менеджеров                     ",
                    "Настроить роутер                                               ",
                    "Поставить новые коммутаторы                                    ",
                    "Дать доступ директору до компьютеров менеджеров                "
            };
    public static String[] tasksForInfobez =
            {
                    "IDC/IPC система                                                ",
                    "Просмотреть логи сети                                          ",
                    "Провести встречу с работником серверной                        ",
                    "Траблшутинг                                                    "
            };
    public static String[] tasksForManager =
            {       "Определение перспективных и текущих целей и задач              ",
                    "Проведение собраний совещаний                                  ",
                    "Работа с документами                                           ",
                    "Контроль, оценка и анализ деятельност группы в целом           "
            };
    public static String[] tasksForMarketingManager =
            {
                    "Изучение рынка и рыночных тенденций                            ",
                    "Выбор целевого рынка                                           ",
                    "Утверждение стратегии развития товара                          ",
                    "Управление отношениями с клиентами                             "
            };
    public static String[] taskOhrannik =
            {
                    "Охранять                                                      "
            };
    public static String[] tasksForSekretar =
            {
                    "Участие в подготовке и проведении совещаний                   ",
                    "Организация связи руководителя                                ",
                    "Организация рабочего времени                                  ",
                    "Поддержание деловых контактов                                 "
            };
    public static String[] tasksForCreative =
            {
                    "переговоры с ключевыми клиентами                              ",
                    "презентация услуг компании и защита проектов перед заказчиками",
                    "составление коммерческих предложений для бизнес-партнеров     ",
                    "разработка концепций рекламных кампаний                       ",
                    "подготовка и проведение презентаций, пресс-конференций        "
            };
    public static String[] tasksForCleaner =
            {
                    "Убрать зал                                                    ",
                    "Убрать туалеты                                                ",
                    "Убрать коридор                                                "
            };
    public static String[] tasksForDesigner =
            {
                    "Нарисовать новый логотип                                      ",
                    "Нарисовать главный экран сайта                                ",
                    "Нарисовать страницку товара                                   ",
                    "Провести встречу с разработчиком сайта                        ",
                    "Нарисовать дизайн мобильной версии сайта                      "
            };


    public static String[] tasksForWeb =
            {
                    "Сверстать страничку товара                                     ",
                    "Выполнить работу по подготовке программ к отладке              ",
                    "Сверстать раздел 'О нас'                                       ",
                    "Провести совещание                                             ",
                    "Начать верстку мобильной версии сайта                          "
            };

    public static String[] manNames =
            {
                    "Александр ",
                    "Алексей   ",
                    "Иван      ",
                    "Григорий  ",
                    "Константин",
                    "Илья      ",
                    "Дмитрий   "
            };

    public static String[] secondNames =
            {
                    "Александрoвич   ",
                    "Алексеевич      ",
                    "Иванович        ",
                    "Григорьевич     ",
                    "Константинович  ",
                    "Николаевич      ",
                    "Михайлович      "
            };

    public static String[] Surnames =
            {
                    "Тарасов  ",
                    "Жуков    ",
                    "Баранов  ",
                    "Филиппов ",
                    "Комаров  ",
                    "Давыдов  ",
                    "Беляев   ",
                    "Герасимов",
                    "Богданов ",
                    "Осипов   ",
                    "Сидоров  ",
                    "Матвеев  ",
                    "Титов    ",
                    "Марков   ",
                    "Миронов  "
            };

}
